fixture/vcr_cassettes/subscription_test/setup.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/customers?limit=100"
    },
    "response": {
      "body": "{\n  \"count\": 0,\n  \"data\": [],\n  \"has_more\": false,\n  \"object\": \"list\",\n  \"url\": \"/v1/customers\"\n}",
      "headers": {
        "Date": "Sat, 18 Feb 2017 23:40:39 GMT",
        "Content-Type": "application/json",
        "Content-Length": "97",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "currency=JPY&id=test-std&name=Test+Plan+Standard&amount=100&interval=month",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/plans"
    },
    "response": {
      "body": "{\n  \"amount\": 100,\n  \"billing_day\": null,\n  \"created\": 1487461239,\n  \"currency\": \"jpy\",\n  \"id\": \"test-std\",\n  \"interval\": \"month\",\n  \"livemode\": false,\n  \"metadata\": {},\n  \"name\": \"Test Plan Standard\",\n  \"object\": \"plan\",\n  \"trial_days\": 0\n}",
      "headers": {
        "Date": "Sat, 18 Feb 2017 23:40:39 GMT",
        "Content-Type": "application/json",
        "Content-Length": "241",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "currency=JPY&id=test-dlx&name=Test+Plan+Deluxe&amount=1000&interval=month",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/plans"
    },
    "response": {
      "body": "{\n  \"amount\": 1000,\n  \"billing_day\": null,\n  \"created\": 1487461239,\n  \"currency\": \"jpy\",\n  \"id\": \"test-dlx\",\n  \"interval\": \"month\",\n  \"livemode\": false,\n  \"metadata\": {},\n  \"name\": \"Test Plan Deluxe\",\n  \"object\": \"plan\",\n  \"trial_days\": 0\n}",
      "headers": {
        "Date": "Sat, 18 Feb 2017 23:40:40 GMT",
        "Content-Type": "application/json",
        "Content-Length": "240",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "email=subscription_test1%40example.com&description=Test+Account&card[number]=4242424242424242&card[exp_month]=1&card[exp_year]=2018&card[cvc]=123&card[name]=Joe+Test+User",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/customers"
    },
    "response": {
      "body": "{\n  \"cards\": {\n    \"count\": 1,\n    \"data\": [\n      {\n        \"address_city\": null,\n        \"address_line1\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": \"unchecked\",\n        \"brand\": \"Visa\",\n        \"country\": null,\n        \"created\": 1487461240,\n        \"customer\": \"cus_7b74b10619d73859a093e5e60458\",\n        \"cvc_check\": \"passed\",\n        \"exp_month\": 1,\n        \"exp_year\": 2018,\n        \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n        \"id\": \"car_4e064abb0e027db6abbc73e2d487\",\n        \"last4\": \"4242\",\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Joe Test User\",\n        \"object\": \"card\"\n      }\n    ],\n    \"has_more\": false,\n    \"object\": \"list\",\n    \"url\": \"/v1/customers/cus_7b74b10619d73859a093e5e60458/cards\"\n  },\n  \"created\": 1487461240,\n  \"default_card\": \"car_4e064abb0e027db6abbc73e2d487\",\n  \"description\": \"Test Account\",\n  \"email\": \"subscription_test1@example.com\",\n  \"id\": \"cus_7b74b10619d73859a093e5e60458\",\n  \"livemode\": false,\n  \"metadata\": {},\n  \"object\": \"customer\",\n  \"subscriptions\": {\n    \"count\": 0,\n    \"data\": [],\n    \"has_more\": false,\n    \"object\": \"list\",\n    \"url\": \"/v1/customers/cus_7b74b10619d73859a093e5e60458/subscriptions\"\n  }\n}",
      "headers": {
        "Date": "Sat, 18 Feb 2017 23:40:40 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1280",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "currency=JPY&id=test-cancel-all&name=Test+Plan+test-cancel-all&amount=100&interval=month",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/plans"
    },
    "response": {
      "body": "{\n  \"error\": {\n    \"code\": \"already_exist_id\",\n    \"message\": \"Plan with ID \\\"test-cancel-all\\\" already exists.\",\n    \"param\": \"id\",\n    \"status\": 400,\n    \"type\": \"client_error\"\n  }\n}",
      "headers": {
        "Date": "Sat, 18 Feb 2017 23:40:40 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "184",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 400,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "currency=JPY&id=test-dlx&name=Test+Plan+test-dlx&amount=100&interval=month",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/plans"
    },
    "response": {
      "body": "{\n  \"error\": {\n    \"code\": \"already_exist_id\",\n    \"message\": \"Plan with ID \\\"test-dlx\\\" already exists.\",\n    \"param\": \"id\",\n    \"status\": 400,\n    \"type\": \"client_error\"\n  }\n}",
      "headers": {
        "Date": "Sat, 18 Feb 2017 23:40:40 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "177",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 400,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "currency=JPY&id=test-dly&name=Test+Plan+test-dly&amount=100&interval=month",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/plans"
    },
    "response": {
      "body": "{\n  \"error\": {\n    \"code\": \"already_exist_id\",\n    \"message\": \"Plan with ID \\\"test-dly\\\" already exists.\",\n    \"param\": \"id\",\n    \"status\": 400,\n    \"type\": \"client_error\"\n  }\n}",
      "headers": {
        "Date": "Sat, 18 Feb 2017 23:40:40 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "177",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 400,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "currency=JPY&id=test-dlz&name=Test+Plan+test-dlz&amount=100&interval=month",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/plans"
    },
    "response": {
      "body": "{\n  \"error\": {\n    \"code\": \"already_exist_id\",\n    \"message\": \"Plan with ID \\\"test-dlz\\\" already exists.\",\n    \"param\": \"id\",\n    \"status\": 400,\n    \"type\": \"client_error\"\n  }\n}",
      "headers": {
        "Date": "Sat, 18 Feb 2017 23:40:40 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "177",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 400,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "currency=JPY&id=test-dla&name=Test+Plan+test-dla&amount=100&interval=month",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/plans"
    },
    "response": {
      "body": "{\n  \"error\": {\n    \"code\": \"already_exist_id\",\n    \"message\": \"Plan with ID \\\"test-dla\\\" already exists.\",\n    \"param\": \"id\",\n    \"status\": 400,\n    \"type\": \"client_error\"\n  }\n}",
      "headers": {
        "Date": "Sat, 18 Feb 2017 23:40:40 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "177",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 400,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "customer=cus_7b74b10619d73859a093e5e60458&plan=test-std",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/subscriptions"
    },
    "response": {
      "body": "{\n  \"canceled_at\": null,\n  \"created\": 1487461241,\n  \"current_period_end\": 1489880441,\n  \"current_period_start\": 1487461241,\n  \"customer\": \"cus_7b74b10619d73859a093e5e60458\",\n  \"id\": \"sub_d6b131aa1219b93e115b32dd7331\",\n  \"livemode\": false,\n  \"metadata\": {},\n  \"object\": \"subscription\",\n  \"paused_at\": null,\n  \"plan\": {\n    \"amount\": 100,\n    \"billing_day\": null,\n    \"created\": 1487461239,\n    \"currency\": \"jpy\",\n    \"id\": \"test-std\",\n    \"interval\": \"month\",\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan Standard\",\n    \"object\": \"plan\",\n    \"trial_days\": 0\n  },\n  \"prorate\": false,\n  \"resumed_at\": null,\n  \"start\": 1487461241,\n  \"status\": \"active\",\n  \"trial_end\": null,\n  \"trial_start\": null\n}",
      "headers": {
        "Date": "Sat, 18 Feb 2017 23:40:41 GMT",
        "Content-Type": "application/json",
        "Content-Length": "714",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "customer=cus_7b74b10619d73859a093e5e60458&plan=test-dlx",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/subscriptions"
    },
    "response": {
      "body": "{\n  \"canceled_at\": null,\n  \"created\": 1487461241,\n  \"current_period_end\": 1489880441,\n  \"current_period_start\": 1487461241,\n  \"customer\": \"cus_7b74b10619d73859a093e5e60458\",\n  \"id\": \"sub_c28668f4532136bfeec6a286d831\",\n  \"livemode\": false,\n  \"metadata\": {},\n  \"object\": \"subscription\",\n  \"paused_at\": null,\n  \"plan\": {\n    \"amount\": 1000,\n    \"billing_day\": null,\n    \"created\": 1487461239,\n    \"currency\": \"jpy\",\n    \"id\": \"test-dlx\",\n    \"interval\": \"month\",\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan Deluxe\",\n    \"object\": \"plan\",\n    \"trial_days\": 0\n  },\n  \"prorate\": false,\n  \"resumed_at\": null,\n  \"start\": 1487461241,\n  \"status\": \"active\",\n  \"trial_end\": null,\n  \"trial_start\": null\n}",
      "headers": {
        "Date": "Sat, 18 Feb 2017 23:40:41 GMT",
        "Content-Type": "application/json",
        "Content-Length": "713",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "customer=cus_7b74b10619d73859a093e5e60458&plan=test-dla",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/subscriptions"
    },
    "response": {
      "body": "{\n  \"canceled_at\": null,\n  \"created\": 1487461241,\n  \"current_period_end\": 1489880441,\n  \"current_period_start\": 1487461241,\n  \"customer\": \"cus_7b74b10619d73859a093e5e60458\",\n  \"id\": \"sub_d01f40d1809b1a2b45bb8bc09367\",\n  \"livemode\": false,\n  \"metadata\": {},\n  \"object\": \"subscription\",\n  \"paused_at\": null,\n  \"plan\": {\n    \"amount\": 100,\n    \"billing_day\": null,\n    \"created\": 1487461144,\n    \"currency\": \"jpy\",\n    \"id\": \"test-dla\",\n    \"interval\": \"month\",\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan test-dla\",\n    \"object\": \"plan\",\n    \"trial_days\": 0\n  },\n  \"prorate\": false,\n  \"resumed_at\": null,\n  \"start\": 1487461241,\n  \"status\": \"active\",\n  \"trial_end\": null,\n  \"trial_start\": null\n}",
      "headers": {
        "Date": "Sat, 18 Feb 2017 23:40:42 GMT",
        "Content-Type": "application/json",
        "Content-Length": "714",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]